---
layout: post
status: publish
published: true
title: 4 formas de se preparar para o Campus Code
author:
  display_name: Alan Batista
  login: alanrrb
  email: alan@campuscode.com.br
  url: ''
author_login: alanrrb
author_email: alan@campuscode.com.br
wordpress_id: 115
wordpress_url: http://campuscode.com.br/blog/?p=115
date: '2015-09-05 16:25:06 -0300'
date_gmt: '2015-09-05 19:25:06 -0300'
categories:
- Not&iacute;cias
- Campus Code
tags: []
comments: []
---
<p><span style="font-weight: 400;">Quando os candidatos vem para conversar sobre como funciona o Campus Code, chegam com uma enxurrada de d&uacute;vidas sobre o nosso programa. <&#47;span><b><a href="http:&#47;&#47;campuscode.com.br&#47;blog&#47;2015&#47;10&#47;5-duvidas-mais-comuns-sobre-o-campus-code&#47;" target="_blank">Aqui<&#47;a><&#47;b><span style="font-weight: 400;"> voc&ecirc; pode saber mais sobre as 5 d&uacute;vidas mais comuns.<&#47;span></p>
<p><span style="font-weight: 400;">E estas s&atilde;o algumas dicas de como se preparar para participar do pr&oacute;ximo time, que come&ccedil;a dia 30 de novembro:<&#47;span></p>
<h3><b>Semana Zero<&#47;b><&#47;h3><br />
<span style="font-weight: 400;">A Semana Zero &eacute; um programa que dura, na realidade, duas semanas. S&atilde;o 24 horas de treinamento pra voc&ecirc; saber o b&aacute;sico do b&aacute;sico da programa&ccedil;&atilde;o e se nivelar para acompanhar o Campus Code. &Eacute; a prepara&ccedil;&atilde;o ideal para quem nunca programou e quer come&ccedil;ar agora.<&#47;span></p>
<p><span style="font-weight: 400;">Quando come&ccedil;a? 16 de novembro, aulas de segunda &agrave; quinta, das 14h &agrave;s 17h.<&#47;span></p>
<h3><b>Code Saga<&#47;b><&#47;h3><br />
<span style="font-weight: 400;">Sem sombra de d&uacute;vidas o <&#47;span><a href="http:&#47;&#47;codesaga.com.br&#47;"><b>Code Saga<&#47;b><&#47;a><span style="font-weight: 400;"> &eacute; o melhor lugar. Ele foi criado pensando nos candidatos ao <&#47;span><b>Campus Code<&#47;b><span style="font-weight: 400;">.<&#47;span></p>
<p><span style="font-weight: 400;">No Code Saga voc&ecirc; vai encontrar, al&eacute;m de tutoriais e desafios, links paras recursos externos como blog de programadores, exerc&iacute;cios e tutoriais nacionais e internacionais.<&#47;span></p>
<p><span style="font-weight: 400;">Quando come&ccedil;a? A qualquer momento. S&oacute; se inscrever no site e come&ccedil;ar a fazer os desafios.<&#47;span></p>
<h3><b>Comunidades<&#47;b><&#47;h3><br />
<span style="font-weight: 400;">Interagir com outros programadores ir&aacute; te ajudar a entender os termos usados, a encontrar pessoas com as mesmas d&uacute;vidas que voc&ecirc; e pessoas precisando de ajuda em dificuldades que voc&ecirc; j&aacute; superou. Isso ser&aacute; uma &oacute;tima forma de consolidar seu conhecimento.&nbsp;<&#47;span></p>
<p><span style="font-weight: 400;">Algumas comunidades e f&oacute;runs:<&#47;span></p>
<ul>
<li><a href="https:&#47;&#47;www.facebook.com&#47;groups&#47;rubyonrailsbrasil" target="_blank">Ruby on Rails Brasil<&#47;a><&#47;li>
<li><a href="http:&#47;&#47;tableless.com.br&#47;" target="_blank">Tableless<&#47;a><&#47;li><br />
<&#47;ul></p>
<h3><b>Eventos<&#47;b><&#47;h3><br />
<span style="font-weight: 400;">Fique atento aos eventos gratuitos e pagos sobre programa&ccedil;&atilde;o e afins. Eventos s&atilde;o &oacute;timos lugares para conhecer outras pessoas, aprender e ter novas id&eacute;ias.<&#47;span></p>
<p><span style="font-weight: 400;">Acompanhe <&#47;span><b><a href="http:&#47;&#47;campuscode.com.br&#47;eventos.html" target="_blank">aqui<&#47;a><&#47;b><span style="font-weight: 400;"> a agenda de eventos que acontecem no Campus Code, ou que estaremos marcando presen&ccedil;a.<&#47;span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Ainda tem d&uacute;vidas se o Campus Code &eacute; o programa certo pra voc&ecirc;? Venha nos visitar, conhecer nosso espa&ccedil;o e bater um papo com nossos Dev Masters. Aproveite para acompanhar alguns momentos do time em treinamento da vez. Estamos sempre de portas abertas de segunda &agrave; quinta, das 18h &agrave;s 21h. &Eacute; s&oacute; agendar sua visita :)<&#47;span></p>
<p>&nbsp;</p>
