---
layout: post
status: publish
published: true
title: 5 d&uacute;vidas mais comuns sobre o Campus Code
author:
  display_name: Claudia Capelini
  login: claucapelini
  email: claudia@campuscode.com.br
  url: ''
author_login: claucapelini
author_email: claudia@campuscode.com.br
wordpress_id: 131
wordpress_url: http://campuscode.com.br/blog/?p=131
date: '2015-10-23 12:59:20 -0200'
date_gmt: '2015-10-23 15:59:20 -0200'
categories:
- Noticias
- Campus Code
tags: []
comments: []
---
<p><span style="font-weight: 400;">Quando os candidatos vem para conversar sobre como funciona o Campus Code, chegam com uma enxurrada de d&uacute;vidas sobre o nosso programa. <&#47;span><b><a href="http:&#47;&#47;campuscode.com.br&#47;blog&#47;2015&#47;09&#47;como-se-preparar-para-o-campus-code&#47;" target="_blank">Aqui<&#47;a><&#47;b><span style="font-weight: 400;"> voc&ecirc; pode saber mais sobre como se preparar para o Campus Code. E estas s&atilde;o as d&uacute;vidas mais comuns:<&#47;span></p>
<h3><b>Preciso j&aacute; saber programar para participar do Campus Code?<&#47;b><&#47;h3><br />
<span style="font-weight: 400;">N&atilde;o, mas &eacute; fundamental ter afinidade com programa&ccedil;&atilde;o e vontade de trabalhar com c&oacute;digo. <&#47;span></p>
<p><span style="font-weight: 400;">J&aacute; fu&ccedil;ou em c&oacute;digos alheios, estudou por conta pr&oacute;pria, seguiu tutoriais e se vira um bocado? Nossos treinamentos foram feitos para voc&ecirc;.<&#47;span></p>
<p><span style="font-weight: 400;">Poxa, nunca nem tentou programar, mas tem muita vontade de aprender? Voc&ecirc; pode optar pela semana zero e ficar prontinho pra mandar bala no Campus Code. Nessa semana fazemos um&nbsp;treinamento pra voc&ecirc; saber o b&aacute;sico do b&aacute;sico da programa&ccedil;&atilde;o e se nivelar para acompanhar o Campus Code.<&#47;span></p>
<h3><b>Preciso ser fluente em ingl&ecirc;s?<&#47;b><&#47;h3><br />
<span style="font-weight: 400;">Esse n&atilde;o &eacute; um requisito impeditivo, voc&ecirc; poder&aacute; ingressar no Campus Code mesmo sem ele. O que muda aqui &eacute; que sua dedica&ccedil;&atilde;o ter&aacute; de ser um pouco maior.<&#47;span></p>
<p><span style="font-weight: 400;">Grande parte dos bons artigos sobre programa&ccedil;&atilde;o em geral s&atilde;o em ingl&ecirc;s, bons programadores brasileiros escrevem artigos em ingl&ecirc;s, as linguagens de programa&ccedil;&atilde;o que voc&ecirc; ter&aacute; contato foram escritas em ingl&ecirc;s. J&aacute; deu para ver que n&atilde;o vai ter como fugir do ingl&ecirc;s.<&#47;span></p>
<p><span style="font-weight: 400;">Se voc&ecirc; tiver conforto lendo, &oacute;timo! Se ouvir bem j&aacute; estar&aacute; bem melhor que muitos, se souber escrever vai conseguir interagir com programadores no mundo e se souber falar <&#47;span><i><span style="font-weight: 400;">a&iacute; &eacute; s&oacute; correr para o abra&ccedil;o<&#47;span><&#47;i><span style="font-weight: 400;">.<&#47;span></p>
<h3><b>Quanto tempo preciso me dedicar ao Campus Code?<&#47;b><&#47;h3><br />
<span style="font-weight: 400;">Cada minuto aqui no Campus Code &eacute; super intenso e voc&ecirc; precisar&aacute; de dedica&ccedil;&atilde;o total. Voc&ecirc; ir&aacute; aprender como a maioria dos bons programadores aprenderam: programando!<&#47;span></p>
<p><span style="font-weight: 400;">Al&eacute;m disso, seu comprometimento &eacute; o diferencial durante sua passagem pelo Campus Code. Pesquisar, ler, assistir palestras sobre programa&ccedil;&atilde;o, t&eacute;cnicas e afins, deve fazer parte do seu dia-a-dia. O quanto voc&ecirc; vai absorver s&oacute; depender&aacute; de voc&ecirc;!<&#47;span></p>
<h3><b>O Campus Code &eacute; remoto ou presencial?<&#47;b><&#47;h3><br />
<span style="font-weight: 400;">Para criar toda a experi&ecirc;ncia de um projeto real, com times trabalhando juntos e sendo guiados pelos Dev Masters, realizamos nossas atividades presencialmente em nossa unidade na Alameda Santos - S&atilde;o Paulo &#47; SP. Durante as 12 semanas do Campus Code trabalharemos juntos 12 horas por semana, mas os projetos v&atilde;o demandar mais horas suas programando remoto. Quanto mais horas investidas, mais c&oacute;digo vamos escrever!<&#47;span></p>
<h3><b>Preciso levar meu notebook?<&#47;b><&#47;h3><br />
<span style="font-weight: 400;">Durante os primeiros dias do Campus Code, configuramos todo o ambiente necess&aacute;rio para os projetos que ser&atilde;o executados. &Eacute; comum que nossos participantes levem seus notebooks nesses dias, afinal teremos diversas sess&otilde;es de programa&ccedil;&atilde;o remota ao longo das 12 semanas.<&#47;span></p>
<p><span style="font-weight: 400;">Fora isso, oferecemos toda estrutura necess&aacute;ria, incluindo notebooks, monitores, blocos para anota&ccedil;&otilde;es etc.<&#47;span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Ainda tem d&uacute;vidas se o Campus Code &eacute; o programa certo pra voc&ecirc;? Venha nos visitar, conhecer nosso espa&ccedil;o e bater um papo com nossos Dev Masters. Aproveite para acompanhar alguns momentos do time em treinamento da vez. Estamos sempre de portas abertas de segunda &agrave; quinta, das 18h &agrave;s 21h. &Eacute; s&oacute; agendar sua visita :)<&#47;span></p>
